/**
 * 
 * 山东省17地市及县区，city的索引对应county索引，如济南在city中的索引为0，县区对应的是county[0]
 */
var city = [ "济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市",
		"荷泽市" ];

var county = [ [ "济南市区", "历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "平阴县", "济阳县", "商河县", "章丘市" ],
		[ "青岛市区", "市南区", "市北区", "四方区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市" ],
		[ "淄博市区", "淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县" ], 
		[ "枣庄市区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市" ],
		[ "东营市区", "东营区", "河口区", "垦利县", "利津县", "广饶县" ],
		[ "烟台市区", "芝罘区", "福山区", "牟平区", "莱山区", "长岛县", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市" ],
		[ "潍坊市区", "潍城区", "寒亭区", "坊子区", "奎文区", "临朐县", "昌乐县", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市" ],
		[ "济宁市区", "市中区", "任城区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "兖州市", "邹城市" ],
		[ "泰安市区", "泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市" ], 
		[ "威海市区", "环翠区", "文登市", "荣成市", "乳山市" ],
		[ "日照市区", "东港区", "岚山区", "五莲县", "莒县" ], 
		[ "莱芜市区", "莱城区", "钢城区" ],
		[ "临沂市区", "兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "苍山县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县" ],
		[ "德州市区", "德城区", "陵县", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市" ],
		[ "聊城市区", "东昌府区", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", "临清市" ],
		[ "滨州市区", "滨城区", "惠民县", "阳信县", "无棣县", "沾化县", "博兴县", "邹平县" ],
		[ "荷泽市区", "牡丹区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "定陶县", "东明县" ] ];

/**
 * 根据城市获取城市的二维数组,用于下拉列表
 * 
 * @param c
 * @return
 */
var getCityArray = function(c) {
	var a = [];
	for ( var i = 0; i < c.length; i++) {
		a[a.length] = [ c[i], c[i] ];
	}
	return a;
}
